# 2. 데이터 다루기

#### 2-1 Series 만들기

- 1차원 자료 : 리스트와 유사, 넘파이의 어레이를 기본으로 만들어짐
- 한 열의 데이터는 모두 동일한 타입

In [8]:
import pandas as pd

In [10]:
a = pd.Series(['banana',10])
type(a)

pandas.core.series.Series

In [12]:
a

0    banana
1        10
dtype: object

In [14]:
b = pd.Series(data = ['홍길동','김철수'], index = ['a', 'b'])
b

a    홍길동
b    김철수
dtype: object

In [16]:
b.head()

a    홍길동
b    김철수
dtype: object

In [18]:
b.loc['a']

'홍길동'

In [20]:
b.iloc[0]

'홍길동'

In [22]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [24]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [26]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [28]:
scientists = pd.DataFrame(
    data = {
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
}
 , index = ["Rosaline Franklin", "William Gosset"])

In [30]:
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [32]:
sc_row = scientists.loc['Rosaline Franklin']
sc_row

Occupation       Chemist
Born          1920-07-25
Died          1958-04-16
Age                   37
Name: Rosaline Franklin, dtype: object

In [34]:
sc_row.values

array(['Chemist', '1920-07-25', '1958-04-16', 37], dtype=object)

In [36]:
sc_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [38]:
# keys() 메소드는 index 속성과 같은 역할이다.
sc_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [40]:
sc_row.keys

<bound method Series.keys of Occupation       Chemist
Born          1920-07-25
Died          1958-04-16
Age                   37
Name: Rosaline Franklin, dtype: object>

In [42]:
sc_row.loc['Age']

37

In [44]:
scientists['Age']

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [46]:
scientists.loc[:,'Age']

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [48]:
age = scientists['Age']
ageMean = age.mean()
ageMin = age.min()
ageMax = age.max()
ageStd = age.std()

print('중앙값 :',ageMean,'\n','최소값 :', ageMin,'\n','최대값 :', ageMax,'\n','표준편차 :', ageStd)

중앙값 : 49.0
 최소값 : 37
 최대값 : 61
 표준편차 : 16.97056274847714

In [50]:
scientists2 = pd.read_csv('../data/scientists.csv')

In [52]:
scientists2.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [54]:
age = scientists2['Age']
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [56]:
age.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [58]:
# 벡터화된 값. 불리언값 리스트
age[age>age.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [60]:
# vector + vector
age + age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [62]:
# vector + scala
age + 10

0     47
1     71
2    100
3     76
4     66
5     55
6     51
7     87
Name: Age, dtype: int64

#### 2-3. 인덱스

In [65]:
rev_age = age.sort_index(ascending = False)
rev_age

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [67]:
age * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [69]:
age + rev_age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [71]:
first_scientists = scientists2[:4]
second_scientists = scientists2[4:]
first_scientists

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [73]:
first_scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist

In [75]:
df1 = df2 = pd.DataFrame(
        data = [
            [1,2,3],[4,5,6]
            ]
)
df1.add(df2)

   0   1   2
0  2   4   6
1  8  10  12

#### 2-4. 열 추가

In [78]:
# data type 바꾸기(str -> int)
born_date = pd.to_datetime(scientists2['Born'], format = '%Y-%m-%d')
born_date

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [80]:
scientists2['BornDate'] = born_date
scientists2.head()

                   Name        Born        Died  Age    Occupation   BornDate
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

In [82]:
scientists2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   BornDate    8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 516.0+ bytes

In [84]:
died_date = pd.to_datetime(scientists2['Died'], format = '%Y-%m-%d')
died_date

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [86]:
scientists2['DiedDate'] = died_date
scientists2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   BornDate    8 non-null      datetime64[ns]
 6   DiedDate    8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 580.0+ bytes

In [88]:
scientists2['age2'] = scientists2['DiedDate'] - scientists2['BornDate']
scientists2['age2'].dtype

dtype('<m8[ns]')

In [90]:
import numpy as np
scientists2['age2'] = (scientists2['age2'].dt.days/365).apply(np.floor)
scientists2

,Name,Born,Died,Age,Occupation,BornDate,DiedDate,age2
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37.0
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90.0
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66.0
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56.0
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45.0
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77.0

In [92]:
scientists2['DiedDate']

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: DiedDate, dtype: datetime64[ns]

1. 각 assign을 분리하여 순차적으로 처리: age2_assign을 먼저 생성하고, 그 이후에 age2_divide365_assign을 생성해야 한다.
** .assign()은 새로운 DataFrame을 반환하는 메서드이므로, assign 할 값을 분리 및 생성한 후, 매번 원본DataFrame에 결과를 덮어써야 한다.<br>
2. 분리 및 순차적 처리

In [95]:
# 1-1) 
scientists2 = scientists2.assign(
    age2_assign = scientists2['DiedDate'] - scientists2['BornDate']
)

In [97]:
# 1-2)
scientists2 = scientists2.assign(
    age2_divide365_assign = (scientists2['age2_assign'].dt.days /365).apply(np.floor)
)

In [99]:
# 2) 
# 이 코드는 .assign()이 한 번만 사용됨
# 먼저 할당한 age2_assign에 값을 할당한 후 해당 변수를 다시 사용하지 않고 수식을 입력했기 떄문에 keyerro 발생없이 실행 가능

scientists2 = scientists2.assign(
    age2_assign = scientists2['DiedDate'] - scientists2['BornDate'],
    age2_divide365_assign = ((scientists2['DiedDate'] - scientists2['BornDate']).dt.days / 365).apply(np.floor)
)

#### 2-5. 열 삭제

In [102]:
scientists2.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'BornDate', 'DiedDate',
       'age2', 'age2_assign', 'age2_divide365_assign'],
      dtype='object')

In [104]:
scientists2.drop(['Age'], axis = 'columns')

,Name,Born,Died,Occupation,BornDate,DiedDate,age2,age2_assign,age2_divide365_assign
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,37.0,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,61.0,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,90.0,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,66.0,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,56.0,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,45.0,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,41.0,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,77.0,28422 days,77.0

#### 2-6. 파일 저장하기

1. pickle로 저장하기
2. python의 data file 형식 : binary save & read
3. Series, DataFrame save
4. csv, tsv, excel 지원
5. to_csv(), read_csv()
6. excel경우는 openxyl을 설치해야 함

In [108]:
scientists2['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [110]:
# 괄호 안에 저장경로와 파일명 입력

scientists2['Name'].to_pickle('../data/scientist2_name_series.pickle')

In [112]:
readSc = pd.read_pickle('../data/scientist2_name_series.pickle')
print(readSc)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [114]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\hhs\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\hhs\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [116]:
import openpyxl as pyxl

# Excel 파일로 저장 (openpyxl 엔진을 사용)
readXl = readSc.to_excel('../data/scientist2_name_series.xlsx', engine='openpyxl')

# 저장한 Excel 파일을 다시 openpyxl을 이용하여 읽기
from openpyxl import load_workbook

# Excel 파일 불러오기
sc2_wb = load_workbook('../data/scientist2_name_series.xlsx')
ws = sc2_wb.active

# 예시로 첫 번째 셀의 값 출력
print(ws['B2'].value)

Rosaline Franklin

In [120]:
scientists2.to_csv('../data/scientist2_name_series.csv')

In [122]:
scientists2_csv_df = pd.read_csv('../data/scientist2_name_series.csv')
type(scientists2_csv_df)

pandas.core.frame.DataFrame

In [124]:
scientists2.head(10)

,Name,Born,Died,Age,Occupation,BornDate,DiedDate,age2,age2_assign,age2_divide365_assign
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37.0,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61.0,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90.0,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66.0,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56.0,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45.0,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41.0,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77.0,28422 days,77.0

In [ ]:
# 사전형식과 데이터프레임의 변환

In [126]:
sci_dict = scientists2.to_dict()
sci_dict

{'Name': {0: 'Rosaline Franklin',
  1: 'William Gosset',
  2: 'Florence Nightingale',
  3: 'Marie Curie',
  4: 'Rachel Carson',
  5: 'John Snow',
  6: 'Alan Turing',
  7: 'Johann Gauss'},
 'Born': {0: '1920-07-25',
  1: '1876-06-13',
  2: '1820-05-12',
  3: '1867-11-07',
  4: '1907-05-27',
  5: '1813-03-15',
  6: '1912-06-23',
  7: '1777-04-30'},
 'Died': {0: '1958-04-16',
  1: '1937-10-16',
  2: '1910-08-13',
  3: '1934-07-04',
  4: '1964-04-14',
  5: '1858-06-16',
  6: '1954-06-07',
  7: '1855-02-23'},
 'Age': {0: 37, 1: 61, 2: 90, 3: 66, 4: 56, 5: 45, 6: 41, 7: 77},
 'Occupation': {0: 'Chemist',
  1: 'Statistician',
  2: 'Nurse',
  3: 'Chemist',
  4: 'Biologist',
  5: 'Physician',
  6: 'Computer Scientist',
  7: 'Mathematician'},
 'BornDate': {0: Timestamp('1920-07-25 00:00:00'),
  1: Timestamp('1876-06-13 00:00:00'),
  2: Timestamp('1820-05-12 00:00:00'),
  3: Timestamp('1867-11-07 00:00:00'),
  4: Timestamp('1907-05-27 00:00:00'),
  5: Timestamp('1813-03-15 00:00:00'),
  6: Timestamp('1912-06-23 00:00:00'),
  7: Timestamp('1777-04-30 00:00:00')},
 'DiedDate': {0: Timestamp('1958-04-16 00:00:00'),
  1: Timestamp('1937-10-16 00:00:00'),
  2: Timestamp('1910-08-13 00:00:00'),
  3: Timestamp('1934-07-04 00:00:00'),
  4: Timestamp('1964-04-14 00:00:00'),
  5: Timestamp('1858-06-16 00:00:00'),
  6: Timestamp('1954-06-07 00:00:00'),
  7: Timestamp('1855-02-23 00:00:00')},
 'age2': {0: 37.0,
  1: 61.0,
  2: 90.0,
  3: 66.0,
  4: 56.0,
  5: 45.0,
  6: 41.0,
  7: 77.0},
 'age2_assign': {0: Timedelta('13779 days 00:00:00'),
  1: Timedelta('22404 days 00:00:00'),
  2: Timedelta('32964 days 00:00:00'),
  3: Timedelta('24345 days 00:00:00'),
  4: Timedelta('20777 days 00:00:00'),
  5: Timedelta('16529 days 00:00:00'),
  6: Timedelta('15324 days 00:00:00'),
  7: Timedelta('28422 days 00:00:00')},
 'age2_divide365_assign': {0: 37.0,
  1: 61.0,
  2: 90.0,
  3: 66.0,
  4: 56.0,
  5: 45.0,
  6: 41.0,
  7: 77.0}}

In [130]:
sci_dict_df = pd.DataFrame.from_dict(sci_dict)
sci_dict_df

,Name,Born,Died,Age,Occupation,BornDate,DiedDate,age2,age2_assign,age2_divide365_assign
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37.0,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61.0,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90.0,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66.0,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56.0,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45.0,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41.0,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77.0,28422 days,77.0

In [132]:
# Dataframe to json

sci_json = scientists2.to_json(orient = 'records', indent = 2 , date_format = 'iso')

type(sci_json)

str

In [134]:
#raw 파일의 데이터 출력 형식을 지정할 수 있다.

import pprint
pprint.pprint(sci_json)

('[\n'
 '  {\n'
 '    "Name":"Rosaline Franklin",\n'
 '    "Born":"1920-07-25",\n'
 '    "Died":"1958-04-16",\n'
 '    "Age":37,\n'
 '    "Occupation":"Chemist",\n'
 '    "BornDate":"1920-07-25T00:00:00.000",\n'
 '    "DiedDate":"1958-04-16T00:00:00.000",\n'
 '    "age2":37.0,\n'
 '    "age2_assign":"P13779DT0H0M0S",\n'
 '    "age2_divide365_assign":37.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"William Gosset",\n'
 '    "Born":"1876-06-13",\n'
 '    "Died":"1937-10-16",\n'
 '    "Age":61,\n'
 '    "Occupation":"Statistician",\n'
 '    "BornDate":"1876-06-13T00:00:00.000",\n'
 '    "DiedDate":"1937-10-16T00:00:00.000",\n'
 '    "age2":61.0,\n'
 '    "age2_assign":"P22404DT0H0M0S",\n'
 '    "age2_divide365_assign":61.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"Florence Nightingale",\n'
 '    "Born":"1820-05-12",\n'
 '    "Died":"1910-08-13",\n'
 '    "Age":90,\n'
 '    "Occupation":"Nurse",\n'
 '    "BornDate":"1820-05-12T00:00:00.000",\n'
 '    "DiedDate":"1910-08-13T00:00:00.000",\n'
 '    "age2":90.0,\n'
 '    "age2_assign":"P32964DT0H0M0S",\n'
 '    "age2_divide365_assign":90.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"Marie Curie",\n'
 '    "Born":"1867-11-07",\n'
 '    "Died":"1934-07-04",\n'
 '    "Age":66,\n'
 '    "Occupation":"Chemist",\n'
 '    "BornDate":"1867-11-07T00:00:00.000",\n'
 '    "DiedDate":"1934-07-04T00:00:00.000",\n'
 '    "age2":66.0,\n'
 '    "age2_assign":"P24345DT0H0M0S",\n'
 '    "age2_divide365_assign":66.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"Rachel Carson",\n'
 '    "Born":"1907-05-27",\n'
 '    "Died":"1964-04-14",\n'
 '    "Age":56,\n'
 '    "Occupation":"Biologist",\n'
 '    "BornDate":"1907-05-27T00:00:00.000",\n'
 '    "DiedDate":"1964-04-14T00:00:00.000",\n'
 '    "age2":56.0,\n'
 '    "age2_assign":"P20777DT0H0M0S",\n'
 '    "age2_divide365_assign":56.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"John Snow",\n'
 '    "Born":"1813-03-15",\n'
 '    "Died":"1858-06-16",\n'
 '    "Age":45,\n'
 '    "Occupation":"Physician",\n'
 '    "BornDate":"1813-03-15T00:00:00.000",\n'
 '    "DiedDate":"1858-06-16T00:00:00.000",\n'
 '    "age2":45.0,\n'
 '    "age2_assign":"P16529DT0H0M0S",\n'
 '    "age2_divide365_assign":45.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"Alan Turing",\n'
 '    "Born":"1912-06-23",\n'
 '    "Died":"1954-06-07",\n'
 '    "Age":41,\n'
 '    "Occupation":"Computer Scientist",\n'
 '    "BornDate":"1912-06-23T00:00:00.000",\n'
 '    "DiedDate":"1954-06-07T00:00:00.000",\n'
 '    "age2":41.0,\n'
 '    "age2_assign":"P15324DT0H0M0S",\n'
 '    "age2_divide365_assign":41.0\n'
 '  },\n'
 '  {\n'
 '    "Name":"Johann Gauss",\n'
 '    "Born":"1777-04-30",\n'
 '    "Died":"1855-02-23",\n'
 '    "Age":77,\n'
 '    "Occupation":"Mathematician",\n'
 '    "BornDate":"1777-04-30T00:00:00.000",\n'
 '    "DiedDate":"1855-02-23T00:00:00.000",\n'
 '    "age2":77.0,\n'
 '    "age2_assign":"P28422DT0H0M0S",\n'
 '    "age2_divide365_assign":77.0\n'
 '  }\n'
 ']')

In [136]:
# json의 dataframe 생성
# dataframe을 이용해 다양한 파일의 형식으로 변환

df_json = pd.read_json(sci_json)

C:\Users\HHS\AppData\Local\Temp\ipykernel_19264\2795305347.py:4: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df_json = pd.read_json(sci_json)